src/Catalogs/КлючиАдресовЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлючиАдресовЗЕРНО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОператорыАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КлючиАдресовЗЕРНО/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Идентификатор");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Идентификатор;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СопоставленныеКлючиАдресов(СкладКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКонтрагент",СкладКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОператорыАдреса.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлючиАдресовЗЕРНО.ОператорыАдреса КАК ОператорыАдреса
	|ГДЕ
	|   ОператорыАдреса.СкладКонтрагент = &СкладКонтрагент";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция СкладыКонтрагентыПоКлючам(КлючиАдресов) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	СсылкиНаКлючи        = Новый Массив;
	
	Если ТипЗнч(КлючиАдресов) = Тип("Массив") Тогда
		СсылкиНаКлючи = КлючиАдресов;
	Иначе
		СсылкиНаКлючи = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КлючиАдресов);
	КонецЕсли;
	
	ОписаниеТипов = ОпределяемыеТипы().СкладКонтрагентЗЕРНО.Тип;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлючиАдресовЗЕРНО.Ссылка          КАК КлючАдреса,
		|	КлючиАдресовЗЕРНО.Идентификатор   КАК Идентификатор,
		|	КлючиАдресовЗЕРНО.ОператорыАдреса.(
		|		СкладКонтрагент КАК СкладКонтрагент) КАК ОператорыАдреса
		|ИЗ
		|	Справочник.КлючиАдресовЗЕРНО КАК КлючиАдресовЗЕРНО
		|ГДЕ
		|	КлючиАдресовЗЕРНО.Ссылка В (&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", СсылкиНаКлючи);
	
	РезультатЗапроса       = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗначениеПоКлючу = ВозвращаемоеЗначение[ВыборкаДетальныеЗаписи.КлючАдреса];
		Если ЗначениеПоКлючу = Неопределено Тогда
			ЗначениеПоКлючу = Новый Массив();
			ВозвращаемоеЗначение[ВыборкаДетальныеЗаписи.КлючАдреса] = ЗначениеПоКлючу;
		КонецЕсли;
		
		СопоставленныеОбъекты = ВыборкаДетальныеЗаписи.ОператорыАдреса.Выбрать();
		Если СопоставленныеОбъекты.Следующий() Тогда
			ТекущееЗначение = Новый Структура("Склад, Контрагент");
			Если ОпределяемыеТипы().Склад.Тип.СодержитТип(ТипЗнч(СопоставленныеОбъекты.СкладКонтрагент)) Тогда
				ТекущееЗначение.Склад = СопоставленныеОбъекты.СкладКонтрагент;
			ИначеЕсли ОпределяемыеТипы().КонтрагентГосИС.Тип.СодержитТип(ТипЗнч(СопоставленныеОбъекты.СкладКонтрагент)) Тогда
				ТекущееЗначение.Контрагент = СопоставленныеОбъекты.СкладКонтрагент;
			КонецЕсли;
			ЗначениеПоКлючу.Добавить(ТекущееЗначение);
		Иначе
			ДанныеПодбора = ИнтеграцияЗЕРНОВызовСервера.СписокАвтоподбора(
				ОписаниеТипов, ВыборкаДетальныеЗаписи.Идентификатор, Ложь);
			Если ДанныеПодбора.Количество() Тогда
				Для Каждого ЭлементСпискаЗначений Из ДанныеПодбора Цикл
					ВладелецАдреса = ЭлементСпискаЗначений.Значение.ВладелецАдреса;
					Если ЗначениеЗаполнено(ВладелецАдреса) Тогда
						ТекущееЗначение = Новый Структура("Склад, Контрагент");
						Если ОпределяемыеТипы().Склад.Тип.СодержитТип(ТипЗнч(ВладелецАдреса)) Тогда
							ТекущееЗначение.Склад = ВладелецАдреса;
						ИначеЕсли ОпределяемыеТипы().КонтрагентГосИС.Тип.СодержитТип(ТипЗнч(ВладелецАдреса)) Тогда
							ТекущееЗначение.Контрагент = ВладелецАдреса;
						Иначе
							Продолжить;
						КонецЕсли;
						ЗначениеПоКлючу.Добавить(ТекущееЗначение);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Записывает в справочник "Ключи адресов ЗЕРНО" соответствие прикладных реквизитов
//   * Не изменяет существующие сопоставления (поле СкладКонтрагент)
//
// Параметры:
//   Ключ            - СправочникСсылка.КлючиРеквизитовОрганизацийЗЕРНО - данные классификатора ЗЕРНО
//   СкладКонтрагент - ОпределяемыйТип.СкладКонтрагентЗЕРНО             - прикладной справочник
//
Процедура СопоставитьСПрикладнымиРеквизитами(Ключ, СкладКонтрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Ключ)
		Или Не ЗначениеЗаполнено(СкладКонтрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКонтрагент", СкладКонтрагент);
	Запрос.УстановитьПараметр("Ссылка", Ключ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1
	|ИЗ
	|	Справочник.КлючиАдресовЗЕРНО.ОператорыАдреса
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И СкладКонтрагент = &СкладКонтрагент";
	Если Запрос.Выполнить().Пустой() Тогда
		КлючОбъект = Ключ.ПолучитьОбъект();
		КлючОбъект.ОператорыАдреса.Добавить().СкладКонтрагент = СкладКонтрагент;
		УстановитьПривилегированныйРежим(Истина);
		КлючОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоискСсылок

Функция ИсходныеДанныеАдреса(Адрес, Индекс = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("PostalCode", Индекс);
	ВозвращаемоеЗначение.Вставить("Address",    Адрес);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция КлючАдреса(ИсходныеДанные, ПараметрыОбмена, Сопоставление = Неопределено) Экспорт
	
	Если ИсходныеДанные = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	ИмяТаблицы = Метаданные.Справочники.КлючиАдресовЗЕРНО.ПолноеИмя();
	
	ДанныеАдреса = ДанныеАдреса(ИсходныеДанные, ПараметрыОбмена, Сопоставление);
	Если Не ЗначениеЗаполнено(ДанныеАдреса.Идентификатор) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	СправочникСсылка = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(
		ПараметрыОбмена, ИмяТаблицы, ДанныеАдреса.Идентификатор);
	
	Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", ДанныеАдреса.Идентификатор);
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка.Заблокировать();
			
			СправочникСсылка = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(ПараметрыОбмена, ИмяТаблицы, ДанныеАдреса.Идентификатор);
			
			Если Не ЗначениеЗаполнено(СправочникСсылка) Тогда
				СправочникСсылка = ЗагрузитьКлючАдреса(ДанныеАдреса, ПараметрыОбмена,, Ложь);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при создании справочника %1 с идентификатором %2:
				           |%3'"),
				Метаданные.Справочники.КлючиАдресовЗЕРНО.Синоним,
				ДанныеАдреса.Идентификатор,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Ошибка при создании справочника %1 с идентификатором %2:
				           |%3'"),
				Метаданные.Справочники.КлючиАдресовЗЕРНО.Синоним,
				ДанныеАдреса.Идентификатор,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ИнтеграцияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
				ТекстОшибкиПодробно,
				НСтр("ru = 'Работа с ключами адресов'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
КонецФункции

Функция ЗагрузитьКлючАдреса(ДанныеАдреса, ПараметрыОбмена, СуществующийОбъект = Неопределено, ТребуетсяПоиск = Истина) Экспорт
	
	ЗаписьНового       = Ложь;
	МетаданныеЭлемента = Метаданные.Справочники.КлючиАдресовЗЕРНО;
	Идентификатор      = ДанныеАдреса.Идентификатор;
	
	Если СуществующийОбъект = Неопределено Тогда
		
		СуществующийЭлемент = Неопределено;
		Если ТребуетсяПоиск Тогда
			СуществующийЭлемент = ИнтеграцияЗЕРНОСлужебный.СсылкаПоИдентификатору(
				ПараметрыОбмена,
				МетаданныеЭлемента.ПолноеИмя(),
				Идентификатор);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СуществующийЭлемент) Тогда
			СуществующийОбъект = СоздатьЭлемент();
			СуществующийОбъект.Идентификатор = Идентификатор;
			
			ЗаписьНового = Истина;
		Иначе
			СуществующийОбъект = СуществующийЭлемент.ПолучитьОбъект();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаписьНового Тогда
		Если ЗначениеЗаполнено(ДанныеАдреса.Сопоставление) Тогда
			НовоеСопоставление = СуществующийОбъект.ОператорыАдреса.Добавить();
			НовоеСопоставление.СкладКонтрагент = ДанныеАдреса.Сопоставление;
		КонецЕсли;
	Иначе
		СуществующийОбъект.Заблокировать();
	КонецЕсли;
	СуществующийОбъект.Индекс = ДанныеАдреса.Индекс;
	СуществующийОбъект.Записать();
	
	ИнтеграцияЗЕРНОСлужебный.ОбновитьСсылку(ПараметрыОбмена, МетаданныеЭлемента.ПолноеИмя(), Идентификатор, СуществующийОбъект.Ссылка);
	
	Возврат СуществующийОбъект.Ссылка;
	
КонецФункции

Функция ДанныеАдреса(ДанныеДокумента, ПараметрыОбмена, Сопоставление)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Идентификатор",  Неопределено);
	ВозвращаемоеЗначение.Вставить("Индекс",         ДанныеДокумента.PostalCode);
	ВозвращаемоеЗначение.Вставить("Адрес",          ДанныеДокумента.Address);
	ВозвращаемоеЗначение.Вставить("Сопоставление",  Сопоставление);
	
	ВозвращаемоеЗначение.Идентификатор = ИнтеграцияЗЕРНОСлужебный.СоставнойКлючОбъекта(
		ДанныеДокумента,
		ПоляСоставногоКлюча(),,
		Ложь,
		", ");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПоляСоставногоКлюча() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив();
	ВозвращаемоеЗначение.Добавить("Address");
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
